Repository: chuxuantinh/hack-tools
Catalog: wapiti-2.3.0-win32-standalone/data/language_sources/*.po
Languages: es, fr

source: Evil url: {0}
es: URL maliciosa: {0}

source: {0} in {1} via injection in the parameter {2}
es: {0} en {1} mediante inyección en el parámetro {2}
fr: {0} dans {1} via une injection dans le paramètre {2}

source: coming from {0}
es: viniendo de {0}
fr: en provanance de {0}

source: {0} in {1} via injection in the query string
es: {0} en {1} mediante inyección en la query de la URL
fr: {0} dans {1} via une injection dans la query string

source: {0} in {1} via injection in the resource path
es: {0} en {1} mediante inyección en la ruta al recurso
fr: {0} dans {1} via une injection dans le chemin de la ressource

source: Involved parameter: {0}
es: Parámetro involucrado: {0}
fr: Paramètre en cause : {0}

source: Evil request:
es: Petición maliciosa:

source: SQL Injection
es: Inyección SQL
fr: Injection SQL

source: Blind SQL Injection
es: Inyección SQL a ciegas
fr: Injection SQL en aveugle

source: File Handling
es: Manejo de fichero
fr: Divulgation de fichier

source: Commands execution
es: Ejecución de comandos
fr: Exécution de commandes

source: Htaccess Bypass
es: Bypass de Htaccess
fr: Contournement de htaccess

source: Backup file
es: Fichero de backup
fr: Copie de sauvegarde

source: Potentially dangerous file
es: Fichero potencialmente peligroso
fr: Fichier potentiellement dangereux

source: Internal Server Error
es: Error interno del servidor
fr: Erreur interne au serveur

source: Resource consumption
es: Consumo de recursos
fr: Consommation anormale de ressource

source: Received a HTTP 500 error in {0}
es: Recibido un error HTTP 500 en {0}
fr: Une erreur HTTP 500 a été obtenue avec {0}

source: Timeout occured in {0}
es: Timeout ocurrido en {0}
fr: Un délais d'attente dépassé a eu lieu avec {0}

source: The request timed out while attempting to inject a payload in the query string
es: Timeout en la petición cuando se intentaba realizar inyectar una cadena maliciosa en la query de la URL
fr: La requête n'a pas aboutie (délais dépassé) lors de l'injection d'un payload dans la query string

source: The request timed out while attempting to inject a payload in the resource path
es: Timeout en la petición cuando se intentaba realizar inyectar una cadena maliciosa en la ruta al recurso
fr: La requête n'a pas aboutie (délais dépassé) lors de l'injection d'un payload dans le chemin de la ressource

source: The request timed out while attempting to inject a payload in the parameter {0}
es: Timeout en la petición cuando se intentaba realizar inyectar una cadena maliciosa en el parámetro {0}
fr: La requête n'a pas aboutie (délais dépassé) lors de l'injection d'un payload dans le paramètre {0}

source: The server responded with a 500 HTTP error code while attempting to inject a payload in the query string
es: El servidor devolvió un error HTTP 500 cuando se intentaba inyectar una cadena maliciosa en la query de la URL
fr: Le serveur a répondu par une erreur HTTP 500 lors de l'injection d'un payload dans la query string

source: The server responded with a 500 HTTP error code while attempting to inject a payload in the resource path
es: El servidor devolvió un error HTTP 500 cuando se intentaba inyectar una cadena maliciosa en el resource path
fr: Le serveur a répondu par une erreur HTTP 500 lors de l'injection d'un payload dans le chemin de la ressource

source: The server responded with a 500 HTTP error code while attempting to inject a payload in the parameter {0}
es: El servidor devolvió un error HTTP 500 cuando se intentaba inyectar una cadena maliciosa en el parámetro {0}
fr: Le serveur a répondu par une erreur HTTP 500 lors de l'injection d'un payload dans le paramètre {0}

source: Invalid argument for option {0} : {1}
es: Argumento inválido para la opción {0} : {1}
fr: Argument invalide pour l'option {0} : {1}

source: [*] Loading modules:
es: [*] Cargando modulos:
fr: [*] Chargement des modules :

source: No links or forms found in this page !
es: No se han encontrado enlaces ni formularios en esta página
fr: Aucun lien ni formulaire trouvé dans cette page !

source: Make sure the url is correct.
es: Compruebe que la URL es correcta.
fr: Assurez-vous que l'URL est correcte.

source: [!] Missing dependecies for module {0}:
es: [!] Dependencias no encontradas para el módulo {0}:
fr: [!] Dépendances manquantes pour le module {0} :

source: [+] Launching module {0}
es: [+] Lanzando módulo {0}
fr: [+] Lancement du module {0}

source: Upload scripts found:
es: Scripts de subida encontrados:
fr: Scripts d'upload trouvés :

source: Report
es: Informe
fr: Rapport

source: A report has been generated in the file {0}
es: Se ha generado un informe en el fichero {0}
fr: Un rapport a été généré dans le fichier {0}

source: Open {0}/index.html with a browser to see this report.
es: Abrir {0}/index.html con el navegador para ver el informe
fr: Ouvrez {0}/index.html dans un navigateur pour voir ce rapport.

source: wapitiDoc
es: Wapiti-2.3.0 - Web application vulnerability scanner Uso: python wapiti.py http://server.com/base/url/ [options] Las opciones soportadas son: -s <url> --start <url> Para indicar una URL con la que comenzar el escaneo. Esta opción puede ser usada varias veces. Wapiti escaneará esos enlaces para encontrar más URLs incluso si el enlace especificado no está en el ámbito. -x <url> --exclude <url> Para excluir una URL del escaneo (por ejemplo URLs de logout). Esta opción puede ser llamada varias veces para especificar varias URLs. Los comodines (*) se pueden usar en las URL como si fuesen expresiones regulares simples. Ejemplo : -x http://server/base/?page=*&module=test o -x http://server/base/admin/* para excluir un directorio. -p <url_proxy> --proxy <url_proxy> Para especificar un proxy. Actualmente los proxies soportados son HTTP y HTTPS. Esta opción puede ser llamada dos veces para especificar el proxy HTTP y HTTPS. Ejemplo: -p http://proxy:port/ -c <cookie_file> --cookie <cookie_file> Para importar cookies que se usarán en el escaneo. La cookie debe ser un fichero en formato JSON. Las cookies pueden ser generadas usando los programas cookie.py y getcookie.py (directorio "net"). -t <timeout> --timeout <timeout> Para establecer un timeout (tiempo máximo en segundo a esperar a la respuesta del servidor). -a <login%password> --auth <login%password> Establece las credenciales para la autentificación HTTP. --auth-method <method> Si el servidor requiere autenticación, establece el método a usar en la autenticación. Actualmente los métodos soportados son (algunos requieren instalar módulos adicionales): + basic + digest + kerberos + ntlm -r <parameter_name> --remove <parameter_name> Borra un parámetro (nombre y valor) de las URLs. -n <limit> --nice <limit> Define un límite de URLs a escanear con el mismo patrón (por ejemplo, el número máximo de valores únicos para el mismo parámetro). Usa esta opción para prevenir bucles infinitos durante el escaneo. El límite debe ser mayor que 0. -m <module_options> --module <module_options> Establece los módulos (y métodos HTTP para cada módulo) para usar en los ataques. Prefix a module name with a dash to deactivate the related module. To only browse the target (without sending any payloads), deactivate every module with -m "-all". If you don't specify the HTTP methods, GET and POST will be used. Example: -m "-all,xss:get,exec:post" -u --color Usa colores para resaltar las vulnerabilidades y anomalias en la salida. -v <level> --verbose <level> Establece el nivel de logs por pantalla. 0: bajo (por defecto), 1: pinta cada URL, 2: pinta cada ataque. -b <scope> --scope <scope> Establece el ámbito del escaneo: + page: analiza solo la página pasada a Wapiti como URL raíz. + folder: analiza todas las URL bajo la misma URL raíz pasado a Wapiti (por defecto). + domain: analiza todos los enlaces a páginas que están en el mismo dominio que la URL pasada a Wapiti. -f <type_file> --format <type_file> Establece el formato del informe. json: Formato JSON format html: Formato HTML format (default) openvas: Formato OpenVAS XML txt: Informe en texto plano (UTF-8) vulneranet: Informe en formato VulneraNET (basado en XML) xml: Formato XML -o <output> --output <output_file> Establece el nombre del fichero con el informe. Si se selecciona HTML como formato del informe, este parámetro será el nombre del directorio donde se guarda el informe. -i <file> --continue <file> Este parámetro indica a Wapiti reanudar el escaneo previo guardado en el fichero XML especificado El nombre del fichero es opcional, si no se especifica Wapiti toma el fichero por defecto de la carpeta "scans". -k <file> --attack <file> Este parámetro indica a Wapiti reanudar los ataques sin escanear de nuevo el website, cargando el escaneo del fichero especificado. El nombre del fichero es opcional, si no se especifica Wapiti toma el fichero por defecto de la carpeta "scans". --verify-ssl <0|1> Este parámetro indica si Wapiti debe comprobar certificados SSL. Por defecto se verifican los certificados -h --help Para imprimir este mensaje de uso de la aplicación
fr: Wapiti-2.3.0 - Un scanneur de vulnérabilités pour applications web Mode d'emploi : python wapiti.py http://server.com/base/url/ [options] Les options possibles sont les suivantes : -s <url> --start <url> Commencer le scan par l'url spécifiée. Cette option peut être appelée plusieurs fois. Wapiti va explorer ces liens afin de trouver de nouvelles URLs même si c'est liens sont hors du périmètre de scan. -x <url> --exclude <url> Pour exclure une url du scan (par exemple un script de déconnexion). Cette option peut être appelée plusieurs fois. L'usage de l'astérisque (*) est possible comme expression régulière basique. Exemple : -x http://server/base/?page=*&module=test ou -x http://server/base/admin/* pour exclure un répertoire -p <url_proxy> --proxy <url_proxy> Spécifier l'utilisation d'un proxy. Les types de proxies actuellement supportés sont HTTP et HTTPs. Cette option peut être appelée deux fois afin d'indiquer le proxy HTTP ainsi que celui pour le HTTPS. Exemple: -p http://proxy:port/ -c <cookie_file> --cookie <cookie_file> Importer des cookies à utiliser pour le scan. Le fichier conteneur de cookies doit être au format JSON. Les cookies peut être récupérés via l'utilisation des outils cookie.py et getcookie.py présents dans le dossier "net". -t <timeout> --timeout <timeout> Définir le temps d'attente (en secondes) d'une réponse du serveur pour une requête. -a <login%password> --auth <login%password> Spécifier des identifiants pour l'authentification HTTP --auth-method <method> Si le serveur réclame une authentification, permet de spéficier la méthode d'authentification à utiliser. Les méthodes actuellement supportées sont (certaines nécessitent l'installation de module supplémentaires) : + basic + digest + kerberos + ntlm -r <parameter_name> --remove <parameter_name> Retirer un paramêtre (nom et valeur) de toutes les URLs. -n <limit> --nice <limit> Définir une limite pour le nombre d'URLs à traiter qui sont basées sur la même construction (càd, le nombre maximum de valeurs uniques pour un même paramètre). Utilisez cette option pour éviter d'entrer dans des boucles infinies lors du scan. Cette valeur doit être supérieur à 0. -m <module_options> --module <module_options> Définir les modules et les méthodes HTTP associées à utiliser pour les attaques. Précédez le nom d'un module par un tiret pour le désactiver. Pour explorer la cible sans lancer la moindre attaque, désactivez tous les modules avec -m "-all". En l'absence de méthodes HTTP spécifiées pour un module, GET et POST seront utilisés. Exemple: -m "-all,xss:get,exec:post" -u --color Utiliser les couleurs du terminal pour mettre en valeur les vulnérabilités et anomalies. -v <level> --verbose <level> Définie le niveau de verbosité des résultats. 0: silencieux (défaut), 1: affiche chaque url, 2: affiche chaque attaque. -b <scope> --scope <scope> Définir le périmètre du scan : + page : analyser uniquement la page donnée en argument principal. + folder : analyser toutes les pages trouvées sous l'arborescence passée comme URL (par défaut). + domain : analyser toutes les pages trouvées pour le domaine correspondant à celui spécifié dans l'URL passée à Wapiti. -f <type_file> --format <type_file> Définir le format du rapport. json: Rapport au format JSON html: Rapport au format HTML (choix par défaut) openvas: Rapport au format XML OpenVAS txt: Rapport au format texte simple (UTF-8) vulneranet: Rapport au format XML VulneraNET xml: Rapport au format XML -o <output> --output <output_file> Spéficier l'emplacement du disque où enregistrer le rapport. Si le rapport est au format html, ce paramètre sera utilisé comme nom de répertoire. -i <file> --continue <file> Reprendre une session de scan en chargeant le status sauvegardé dans le fichier XML spécifié. Si le paramètre est appelé sans argument, Wapiti charge la session depuis un fichier par défaut présent dans le dossier "scans". -k <file> --attack <file> Lancer directement les attaques en chargeant les URLs présentes dans le fichier XML de status spécifié (sans relancer l'exploration des pages du site). Si le fichier n'est pas spécifié, Wapiti charge un fichier par défaut présent dans le dossier "scans". --verify-ssl <0|1> Indique à Wapiti s'il doit ou non vérifier les certificats SSL. Le comportement par défaut est de vérifieir les certificats. -h --help Afficher ce message d'aide

source: File {0} loaded. Wapiti will use it to perform the attack
es: Archivo {0} cargado. Wapiti lo usará para realizar el ataque
fr: Fichier {0} chargé. Wapiti va s'en servir pour effectuer l'attaque

source: error: {0} while attacking {1}
es: error: {0} mientras se realizaba el ataque {1}
fr: erreur : {0} lors de l'attaque de {1}

source: error: timeout while attacking {0}
es: error: timeout mientras se atacaba {0}
fr: erreur: délais d'attente dépassé lors de l'attaque de {0}

source: + attackPOST {0} from {1}
es: + attackPOST {0} de {1}
fr: + attackPOST {0} en provenance de {1}

source: Found backup file !
es: ¡Encontrado fichero de backup!
fr: Copie de sauvegarde trouvée !

source: Backup file {0} found for {1}
es: Fichero de backup {0} encontrado para {1}
fr: Copie de sauvegarde {0} trouvée pour {1}

source: Blind SQL vulnerability
es: Inyección SQL ciega
fr: Faille d'injection SQL en aveugle

source: {0} via injection in the query string
es: {0} mediante inyección en la query de la URL
fr: {0} via une injection dans la query string

source: {0} via injection in the parameter {1}
es: {0} mediante inyección en el parámetro {1}
fr: {0} via une injection dans le paramètre {1}

source: CRLF injection
es: Inyección CRLF

source: Error: The server did not understand this request
es: Error: El servidor no entendió esta petición
fr: Erreur : Le serveur n'a pas compris la requête

source: Command execution
es: Ejecución de comando
fr: Exécution de commande

source: PHP evaluation
es: Evaluación PHP
fr: Interprétation de code PHP

source: preg_replace injection
es: Inyección preg_replace
fr: Injection via preg_replace

source: Remote inclusion vulnerability
es: Vulnerabilidad de inclusión remota
fr: Faille d'inclusion distante

source: Linux local file disclosure vulnerability
es: Vulnerabilidad 'Local file disclosure' en Linux
fr: Divulgation de fichiers sur un système Linux

source: BSD local file disclosure vulnerability
es: Vulnerabilidad de 'Local file disclosure' en BSD
fr: Divulgation de fichiers sur un système BSD

source: Windows local file disclosure vulnerability
es: Vulnerabilidad de 'Local file disclosure' en Windows
fr: Divulgation de fichiers sur un système Window

source: File disclosure vulnerability in include_path
es: Vulnerabilidad de 'Local file disclosure' en include_path
fr: Divulgation de fichier présent dans le include_path

source: highlight_file() vulnerability in basedir
es: Vulnerabilidad highlight_file() en basedir
fr: Divulgation de fichier présent dans basedur vie highlight_file()

source: include() of file in include_path
es: include() de fichero en include_path
fr: Inclusion d'un fichier présent dans le include_path

source: Possible {0} vulnerability
es: Posible vulnerabilidad {0}
fr: Eventuelle faille de type {0}

source: HtAccess protection found: {0}
es: Protección HtAccess encontrada: {0}
fr: Protection par htaccess trouvée : {0}

source: Source code:
es: Código fuente:
fr: Code source :

source: {0} HtAccess
es: HtAccess {0}

source: .htaccess bypass vulnerability: {0}
es: Vulnerabilidad de bypass de .htaccess: {0}
fr: Disfonctionnement dans la protection .htaccess : {0}

source: |HTTP Code: {0}
es: |Código HTTP: {0}
fr: | Code HTTP : {0}

source: Problem with local nikto database.
es: Problema con la base de datos local Nikto
fr: Un problème est survenu avec la base de données nikto locale

source: Downloading from the web...
es: Descargando de la web...
fr: Téléchargement depuis le web...

source: Error downloading Nikto database
es: Error descargando la base de datos Nikto
fr: Erreur de téléchargement de la base Nikto

source: References:
es: Referencias:
fr: Références

source: Stored XSS vulnerability
es: Guardada vulnerabilidad XSS
fr: Faille XSS permanent

source: Found permanent XSS in {0} with {1}
es: Encontrada XSS permanente en {0} con {1}
fr: Un XSS permanent a été trouvé dans {0} avec {1}

source: Found permanent XSS attacked by {0} with fields {1}
es: Encontrado XSS permanente atacando {0} con campos {1}
fr: Un XSS permanent a été trouvé en envoyant les champs {1} depuis {0}

source: MySQL Injection
es: Inyección MySQL
fr: Injection MySQL

source: Access-Based SQL Injection
es: Inyección SQL en sistema Access
fr: Injection SQL sur système MS-Access

source: MSSQL-Based Injection
es: Inyección MSSQL
fr: Injection MSSQL

source: Java.SQL Injection
es: Inyección Java.SQL
fr: Injection SQL Java

source: PostgreSQL Injection
es: Inyección PostgreSQL
fr: Injection PostgreSQL

source: XPath Injection
es: Inyección XPath
fr: Injection XPath

source: LDAP Injection
es: Inyección LDAP
fr: Injection LDAP

source: DB2 Injection
es: Inyección DB2
fr: Injection SQL DB2

source: Interbase Injection
es: Inyección Interbase
fr: Injection SQL Interbase

source: Sybase Injection
es: Inyección Sybase
fr: Injection SQL Sybase

source: .NET SQL Injection
es: Inyección .NET SQL
fr: Injection SQL .NET

source: Acess-Based SQL Injection
es: Inyección Acess-Based SQL

source: Oracle Injection
es: Inyección Oracle
fr: Injection SQL Oracle

source: XSS vulnerability
es: Vulnerabilidad XSS
fr: Faille XSS

source: XSS vulnerability found via injection in the resource path
es: Vulnerabilidad XSS encontrada mediante inyección en la ruta al recurso
fr: Faille XSS trouvée via l'injection dans le chemin de la ressource

source: XSS vulnerability found via injection in the query string
es: Vulnerabilidad XSS encontrada mediante inyección en la query de la URL
fr: Faille XSS trouvée via l'injection dans la query string

source: XSS vulnerability found via injection in the parameter {0}
es: Vulnerabilidad XSS encontrada mediante inyección en el parámetro {0}
fr: Faille XSS trouvée via l'injection dans le paramètre {0}

source: No forms found in this page !
es: No se han encontrado formularios en esta página
fr: Aucun formulaire n'a été trouvé dans cette page !

source: Choose the form you want to use :
es: Elige el formulario que deseas usar:
fr: Sélectionnez le formulaire que vous souhaitez utiliser :

source: Enter a number :
es: Elige un número:
fr: Entrez un numéro :

source: Please enter values for the following form:
es: Por favor, introduce valores para este formulario:
fr: Veuillez renseignr les champs pour le formulaire suivant :

source: Error getting url {0}
es: Error recuperando la URL {0}
fr: Impossible d'atteindre l'URL {0}

source: First argument must be the root url !
es: El primer argumento debe ser la URL raíz
fr: Le premier argument doit être l'URL racine !

source: Invalid protocol: {0}
es: Protocolo inválido: {0}
fr: Protocole invalide : {0}

source: Invalid link argument: {0}
es: En argumento no es un enlace válido: {0}
fr: Cet argument n'est pas un lien valide : {0}

source: Connection refused!
es: Conexión rechazada!
fr: Connexion refusée !

source: Exception in lswww.browse: {0}
es: Excepción en lswww.browse: {0}
fr: Exception reçue dans lswww.browse : {0}

source: File {0} loaded, the scan continues:
es: Archivo {0} cargado, el escaneo continua:
fr: Fichier {0} chargé, le scan continue :

source: * URLs to browse
es: * URLs a escanear
fr: * URLs à explorer

source: * URLs browsed
es: * URL escaneadas
fr: * URLs explorées

source: File {0} not found, Wapiti will scan again the web site
es: Fichero {0} no encontrado, Wapiti escaneará el website de nuevo
fr: Le Fichier {0} n'a pas été trouvé, Wapiti va recommencer le scan du site

source: Notice
es: Aviso

source: This scan has been saved in the file {0}/{1}.xml
es: Este escaneo se ha guardado en el archivo {0}/{1}.xml
fr: Le scan a été sauvegardé dans le fichier {0}/{1}.xml

source: You can use it to perform attacks without scanning again the web site with the "-k" parameter
es: Puedes usarlo para realizar ataques sin escanear de nuevo el website mediante el parámetro "-k"
fr: Vous pouvez l'utiliser pour lancer de futures attaques sans avoir à relancer le scan via le paramètre "-k"

source: Scan stopped, the data has been savedin the file {0}/{1}.xml
es: Escaneo detenido, la información se ha salvado en el archivo {0}/{1}.xml

source: To continue this scan, you should launch Wapiti with the "-i" parameter
es: Para continuar con este escaneo, debes lanzar Wapiti con el parámetro "-i"
fr: Pour reprendre ce scan, vous pouvez lancer wapiti avec l'option "-i"

source: Forms Info
es: Información de los formularios
fr: Formulaires

source: From: {0}
es: De: {0}
fr: Depuis: {0}

source: To: {0}
es: A: {0}
fr: Vers: {0}

source: Upload Scripts
es: Subida de scripts
fr: Scripts d'upload

source: Forms
es: Formularios
fr: Formulaires

source: Form {0}
es: Formulario {0}
fr: Formulaire {0}

source: * Method: {0}
es: * Método: {0}
fr: * Méthode : {0}

source: * Intputs:
es: * Inputs:

source: Report for {0}
es: Informe para {0}
fr: Rapport pour {0}

source: Date of the scan : {0}
es: Fecha del escaneo: {0}
fr: Date du scan : {0}

source: Scope of the scan : {0}
es: Ámbito del escaneo: {0}
fr: Portée de ce scan : {0}

source: Summary of vulnerabilities :
es: Resumen de vulnerabilidades
fr: Résumé des vulnérabilités :

source: Evil request:
es: Petición maliciosa:

source: Anomalies found:
es: Anomalias encontradas
fr: Anomalies rencontrées :

source: Attack process interrupted. To perform again the attack, lauch Wapiti with "-i" or "-k" parameter.
es: Proceso de ataque interrumpido. Para realizar el ataque de nuevo lance Wapiti con los parámetros "-i" o "-k".
fr: Le processus d'attaque a été interrompu. Pour relancer l'attaque, lancez Wapiti avec les options "-i" ou "-k"

source: File {0} not found. Wapiti will scan the web site again
es: Archivo {0} no encontrado. Wapiti escaneará el website de nuevo
fr: Le fichier {0} n'a pas été trouvé. Wapiti va scanner le site à nouveau

source: [!] Unable to find a module named {0}
es: [!] Imposible encontrar el módulo llamado {0}
fr: [!] Impossible de trouver le module {0}
