Repository: chuxuantinh/hack-tools
Catalog: wapiti-2.3.0-win32-standalone/data/language_sources/*.po
Languages: es, fr

source: Backup file description
es: Es posible que se encuentren archivos de backup de los comandos ejecutados en el servidor que el administrador dejó para guardar una versión anterior o archivos de copia de seguridad que se generan automáticamente por editores de texto (como por ejemplo, Emacs). Estas copias pueden revelar código fuente o contraseñas.
fr: Il se peut que des copies de sauvegarde de scripts soient accessibles sur le serveur. L'administrateur web a du placer volontairement une sauvegarde dans l'idée de revenir à une précédente version ou involontairement en utilisant un éditeur configuré pour sauver automatiquement une copie après une certaine durée.Ces fichiers peuvent révéler des informations intéressantes comme du code source ou encore des identifiants (accès à la base de données).

source: Backup file solution
es: El administrador necesita borrar la copia de seguridad o moverla fuera de los directorios de la aplicación web. También debe desactivar las copias de seguridad automáticas en la configuración del editor de texto.
fr: L'administrateur web doit supprimer manuellement les sauvegardes présentes sous la racine web et reconfigurer l'éditeur qu'il utilise pour désactiver les sauvegardes automatiques.

source: Blind SQL Injection description
es: La inyección SQL a ciegas es una técnica que se aprovecha de una vulnerabilidad en la base de datos de la aplicación. Este tipo de vulnerabilidad es más difícil de detectar que una inyección SQL clásica ya que no muestra ningún mensaje en la web.
fr: Tout comme les failles d'injection SQL classiques, les injections SQL en aveugle permettent à un attaquant d'altérer les requêtes normalement exécutées sur la base de données. Ce type de vulnérabilité est plus difficile à détecter en raison de l'absence de messages d'erreur renvoyés par l'application web.

source: Blind SQL Injection solution
es: Para proteger una aplicación de una inyección SQL, el usuario no debe utilizar consultas SQL directamente en el código. Los parámetros suministrados por el usuario deben ser escapados y filtrados. Las consultas deben estar parametrizadas.
fr: Pour se protéger des injections SQL, les données fournies par les utilisateurs ne doivent pas être utilisées telles-quelles dans les requêtes SQL mais doivent faire l'objet de vérifications (filtres, échappements) approfondies.

source: Commands execution description
es: Este ataque consiste en ejecutar comandos del sistema en el servidor. El atacante trata de inyectar comandos en los parámetros de la petición.
fr: Ce type d'attaque consiste à faire exécuter des commandes sur le serveur. L'attaquant tente d'injecter les commandes dans les paramêtres de requêtes qui lui sont accessibles.

source: Commands execution solution
es: Se debe evitar utilizar parámetros suministrados por el usuario en las llamadas al sistema de ficheros.
fr: Ce type de vulnérabilité résulte souvent d'un manque de vérifications sur les données soumises par le visiteur. Pour les opérations sur les accès fichiers il est préférable d'utiliser des appels systèmes spécialisés au lieu de tenter de faire exécuter des commandes shell.

source: CRLF description
es: El término CRLF se refiere a 'Carriage Return (ASCII 13, \r) Line Feed (ASCII 10, \n)' (en inglés). Esos caracteres se utilizan para indicar el final de una línea, sin embargo no todos los sistemas operativos los interpretan de la misma forma. Por ejemplo, en Windows, ambos, CR y LF son necesarios para marcar el final de la línea, mientras que en Linux/UNIX sólo LF es necesario. La combinación de CR y LF es usada por ejemplo cuando se presiona 'Enter'. Dependiendo de la aplicación, presionar 'Enter' crea una nueva línea o ejecuta un comando.
fr: Le terme CRLF fait référence à Carriage Return (ASCII 13, \r) Line Feed (ASCII 10, \n). Dans le protocole HTTP, ces deux caractères à la suite permettent entre autres de passer à la ligne d'entête suivante.Un script qui insère directement dans ses entêtes des données fournies par l'utilisateur peut alors se voir injecter des lignes d'entêtes qui seront interprétées par le navigateur de la victime.

source: CRLF solution
es: Comprobar los parámetros suministrados por el usuario y filtrar CR y LF.
fr: Vérifiez que les couples nom / valeur retournés dans les entêtes HTTP ne contiennent pas la suite de caractères CRLF.

source: Cross Site Scripting description
es: Cross-site scripting (XSS) es un tipo de vulnerabilidad que normalmente se encuentra en aplicaciones web que permiten la inyección de código malicioso en páginas que son vistas por otros usuarios. Un ejemplo es la inyección de código HTML y javascript.
fr: Le Cross-site scripting (XSS) est une catégorie de vulnérabilités web qui permet d'exécuter du code dans le navigateur des visiteurs du site. Leur exploitation peut par exemple permettre le détournement d'une session qui a été ouverte sur un site par un utilisateur valide.

source: Cross Site Scripting solution
es: La mejor forma de proteger una aplicación web de ataques XXS es asegurarse de que la aplicación valida todas las cabeceras, las cookies y todos los campos de los formularios (visibles y ocultos) que son enviados al servidor. También se debe validar toda la información que se manda al usuario desde el servidor para evitar que scripts inyectados puedan ejecutarse en los navegadores de otros usuarios. Una buena forma de proteger aplicaciones web de este tipo de ataques es convertir los siguientes caracteres en su equivalente en HTML: &lt;, &gt;, &amp;, &quot;, ', (, ), #, %, ; , +, -.
fr: Afin de se protéger des attaques XSS, il faut s'assurer que les données retournées dans une page ne contiennent pas certains caractères interprétés par le navigateur.Certains caractères considérés dangereux peuvent être remplacés par leur code d'entité HTML.

source: File Handling description
es: Este ataque también se conoce como 'Path Transversal' o 'Directory Transversal'. Su objetivo es acceder a ficheros y directorios que se encuentran fuera del directorio de la aplicación web. El atacante es capaz de acceder a los directorios del servidor utilizando distintas técnicas como por ejemplo la manipulación de variables que referencian a ficheros con secuencias de '../' para moverse por los directorios del servidor.
fr: Ces techniques permet à l'attaquant d'accèder à des fichiers auxquels il n'est pas sensé accèder car en dehors de la racine du serveur web. En utilisant certaines séquences comme '../', il peut remonter dans l'arborescence pour ainsi lister des répertoires ou obtenir le contenu de fichiers.

source: File Handling solution
es: Evite trabajar con información suministrada por el usuario cuando haga llamadas al sistema de ficheros. Use índices en vez de nombres o partes del nombre de los ficheros. Por ejemplo, utilice idioma=5 para acceder a la página en sueco en vez de utilizar idioma=sueco. Valide todos los parámetros suministrados por el usuario chequeando una lista de valores posibles. Utilice 'chrooted jails' y restrinja el acceso de los ficheros adecuadamente.
fr: Ne laissez pas aux utilisateurs la possibilité de choisir une ou plusieurs parties du nom d'un fichier ou d'un répertoire. Générez vous même des noms aléatoire en cas de création ou utilisez des correspondances en cas de templates (un ID numérique correspondant à une chaine de caractères. Utilisez des jails chroot et des restrictions d'accès pour limiter le nombre de fichiers accessibles par le serveur.

source: Htaccess bypass description
es: Los ficheros htaccess se usan para restringir el acceso de algunos ficheros o métodos HTTP. En algunos casos, es posible saltarse esta protección y acceder a los ficheros.
fr: Les fichiers htaccess permettent de restreindre l'accès a des fichiers ou répertoires en fonction d'identifiants ou méthode HTTP utilisés. Si la configuration a été mal faite il peut être possible de contourner la restriction.

source: Htaccess bypass solution
es: Asegúrese de que todas las llamadas HTTP se prohiben en el caso en el que las credenciales sean incorrectas.
fr: La configuration du htaccess doit être minutieusement vérifiée pour ne pas laisser une porte d'entrée à un éventuel attaquant.

source: Internal server error description
es: Un error en el servidor que evita que se procese la petición puede ser una señal de que existe una vulnerabilidad.
fr: Erreur interne au serveur. Le serveur a fait face à une situation inattendue qui l'a empêché de traiter convenablement la requête. Cela peut être le signe de la présence d'une vulnérabilité.

source: Internal server error solution
es: Investigue los logs del servidor en busca de información más detallada sobre el error.
fr: Les logs de votre serveur HTTP ou de l'application web concernée devraient vous renseigner sur la nature exacte du problème.

source: Potentially dangerous file description
es: Un fichero con vulnerabilidades se ha encontrado en el sitio web.
fr: Certains scripts sont connus pour être potentiellement vulnérables et dangereux. Des listes de tels fichiers existent et sont fréquemment utilisées par des attaquants pour scanner des sites Internet à la recherche de ces vulnérabilitées.

source: Potentially dangerous file solution
es: Asegúrese de que el script se encuentra actualizado y de que sus permisos son lo más restrictivos posible.
fr: L'administrateur devrait vérifier régulièrement si des mises à jour sont disponibles pour les scripts et logiciels utilisés sur le serveur. Il est aussi conseillé de se tenir informé sur les nouvelles vulnérabilités trouvées en s'abonnant à des listes de sécurité ou en suivant des flux RSS spécialisés.

source: Resource consumption description
es: Al servidor le llevó más tiempo de lo normal el responder a una consulta. Un atacante puede utilizar esta debilidad como un arma para sobrecargar al sistema.
fr: Il a fallu un temps anormallement long au serveur pour traiter la reqêquete. Un attaquant pourrait exploiter ce type de faiblesse pour surcharger le serveur.

source: Resource consumption solution
es: El script en cuestión puede que esté utilizando los recursos (CPU, memoria, acceso de ficheros, base de datos…) de una manera ineficiente.
fr: Le script en cause utilise probablement certaines ressources système (CPU, mémoire, accès disque etc) de façon inneficace. Son améliorations devrait être étudiée.

source: SQL Injection description
es: Las vulnerabilidades SQL permiten al atacante alterar las queries que son ejecutadas en la base de datos.El atacante puede extraer o modificar la información de la base de datos o incluso obtener más privilegios en el sistema.
fr: Les failles d'injection SQL permettent à un attaquant de modifier les requêtes qui sont normalement exécutées sur le système de base de données. Un attaquant peut alors parvenir à extraire où à modifier des informations en base. Cela peut aussi potentiellement permettre à l'attaquant d'augmenter ses privilèges sur le système.

source: SQL Injection solution
es: Para protegerse de inyecciones SQL, los parámetros de usuario no se deben utilizar directamente para la crear la sentencia SQL. Esos parámetros se deben escapar o filtrar. Las consultas deben estar parametrizadas.
fr: Pour se protéger des injections SQL, les données fournies par les utilisateurs ne doivent pas être utilisées telles-quelles dans les requêtes SQL mais doivent faire l'objet de vérifications (filtres, échappements) approfondies.

source: CRLF Injection
fr: Injection CRLF

source: Warning exec
fr: Avertissement exec

source: Warning usort()
fr: Avertissement usort()

source: Warning assert
fr: Avertissement assert

source: Evalutation warning
fr: Avertissement d'une évaluation

source: |HTTP Code: {0} : {1}
fr: | Code HTTP : {0} : {1}

source: Scan stopped, the data has been saved in the file {0}/{1}.xml
fr: Scan interrompu, les données ont été sauvegardées dans le fichier {0}/{1}.xml

source: cURL command PoC : "{0}"
fr: PoC en commande cURL : "{0}"
